benchmarks/results/auth-serialization/test-signup/baseline/wrk2-logs/run_2_1805_1303.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 490.009ms, rate sampling interval: 1419ms
  Thread calibration: mean lat.: 694.186ms, rate sampling interval: 1420ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   600.32ms  178.22ms 752.64ms   75.00%
    Req/Sec     1.89      0.31     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  701.95ms
 75.000%  708.09ms
 90.000%  712.19ms
 99.000%  752.64ms
 99.900%  753.15ms
 99.990%  753.15ms
 99.999%  753.15ms
100.000%  753.15ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     272.639     0.000000            1         1.00
     292.095     0.100000           10         1.11
     302.591     0.200000           20         1.25
     692.735     0.300000           30         1.43
     698.367     0.400000           40         1.67
     701.951     0.500000           53         2.00
     702.463     0.550000           58         2.22
     703.487     0.600000           60         2.50
     706.047     0.650000           65         2.86
     707.071     0.700000           73         3.33
     708.095     0.750000           76         4.00
     709.119     0.775000           79         4.44
     709.631     0.800000           83         5.00
     709.631     0.825000           83         5.71
     710.143     0.850000           86         6.67
     710.655     0.875000           88         8.00
     711.167     0.887500           89         8.89
     712.191     0.900000           90        10.00
     713.215     0.912500           93        11.43
     713.215     0.925000           93        13.33
     713.727     0.937500           94        16.00
     716.799     0.943750           95        17.78
     716.799     0.950000           95        20.00
     717.311     0.956250           96        22.86
     717.823     0.962500           97        26.67
     717.823     0.968750           97        32.00
     752.127     0.971875           98        35.56
     752.127     0.975000           98        40.00
     752.127     0.978125           98        45.71
     752.639     0.981250           99        53.33
     752.639     0.984375           99        64.00
     752.639     0.985938           99        71.11
     752.639     0.987500           99        80.00
     752.639     0.989062           99        91.43
     753.151     0.990625          100       106.67
     753.151     1.000000          100          inf
#[Mean    =      600.324, StdDeviation   =      178.217]
#[Max     =      752.640, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  149 requests in 30.01s, 60.64KB read
Requests/sec:      4.96
Transfer/sec:      2.02KB