benchmarks/results/auth-serialization/test-signup/baseline/wrk2-logs/run_3_1805_1304.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/signup
  2 threads and 4 connections
  Thread calibration: mean lat.: 665.002ms, rate sampling interval: 1360ms
  Thread calibration: mean lat.: 665.216ms, rate sampling interval: 1354ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   662.76ms    9.79ms 682.50ms   63.00%
    Req/Sec     1.71      0.45     2.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  665.60ms
 75.000%  669.70ms
 90.000%  674.30ms
 99.000%  679.93ms
 99.900%  683.01ms
 99.990%  683.01ms
 99.999%  683.01ms
100.000%  683.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     637.951     0.000000            1         1.00
     650.751     0.100000           11         1.11
     653.311     0.200000           23         1.25
     656.383     0.300000           30         1.43
     660.991     0.400000           41         1.67
     665.599     0.500000           51         2.00
     666.111     0.550000           55         2.22
     667.135     0.600000           63         2.50
     667.647     0.650000           65         2.86
     668.671     0.700000           71         3.33
     669.695     0.750000           75         4.00
     670.207     0.775000           78         4.44
     671.231     0.800000           81         5.00
     671.743     0.825000           83         5.71
     672.767     0.850000           86         6.67
     673.791     0.875000           89         8.00
     673.791     0.887500           89         8.89
     674.303     0.900000           90        10.00
     675.327     0.912500           92        11.43
     676.863     0.925000           93        13.33
     678.399     0.937500           95        16.00
     678.399     0.943750           95        17.78
     678.399     0.950000           95        20.00
     678.911     0.956250           96        22.86
     679.423     0.962500           98        26.67
     679.423     0.968750           98        32.00
     679.423     0.971875           98        35.56
     679.423     0.975000           98        40.00
     679.423     0.978125           98        45.71
     679.935     0.981250           99        53.33
     679.935     0.984375           99        64.00
     679.935     0.985938           99        71.11
     679.935     0.987500           99        80.00
     679.935     0.989062           99        91.43
     683.007     0.990625          100       106.67
     683.007     1.000000          100          inf
#[Mean    =      662.764, StdDeviation   =        9.790]
#[Max     =      682.496, Total count    =          100]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  148 requests in 30.02s, 60.24KB read
Requests/sec:      4.93
Transfer/sec:      2.01KB